src/InformationRegisters/SQLВыполнениеЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>SQLВыполнениеЗаданий</Name>
			<Comment>DEV-9782</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОшибкаВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаJson</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтложеноДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SQLЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/SQLВыполнениеЗаданий/Ext/Module.bsl
Процедура ОбработатьЗадания() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Т.Задание КАК Задание,
	|	Т.КлючПараметров КАК КлючПараметров,
	|	Т.СтрокаJson КАК СтрокаJson
	|ИЗ
	|	РегистрСведений.SQLВыполнениеЗаданий КАК Т
	|ГДЕ
	|	НЕ Т.РезультатВыполнения
	|	И Т.КоличествоПопыток < &КоличествоПопыток"; 
	
	КоличествоПопыток = 3;
    Запрос.УстановитьПараметр("КоличествоПопыток",КоличествоПопыток);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		СтруктураПараметров = Новый Структура;
		Если Не Выборка.КлючПараметров = "" Тогда
			СтруктураПараметров = СтрокаJSONВСтруктуруПараметров(Выборка.СтрокаJson);
			Если Не СтруктураПараметров.Свойство("Задание") Тогда
				СтруктураПараметров.Вставить("Задание", Выборка.Задание);
			КонецЕсли;   
			Если Не СтруктураПараметров.Свойство("КлючПараметров") Тогда
				СтруктураПараметров.Вставить("КлючПараметров", Выборка.КлючПараметров);
			КонецЕсли;   
		Иначе
			СтруктураПараметров.Вставить("Задание", Выборка.Задание);
		КонецЕсли;
		ЕстьОшибка = "";
		Попытка
			ВыполнитьЗадание(Выборка.Задание, СтруктураПараметров, ЕстьОшибка);
		Исключение
			Если ОписаниеОшибки() = "" Тогда
				ЕстьОшибка = "Неизвестная ошибка!";	
			Иначе					
				ЕстьОшибка = ОписаниеОшибки();
			КонецЕсли;
		КонецПопытки;
		Набор = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьНаборЗаписей();
		Набор.Отбор.Задание.Значение = Выборка.Задание;
		Набор.Отбор.Задание.Использование = Истина;
		Набор.Отбор.КлючПараметров.Значение = Выборка.КлючПараметров;
		Набор.Отбор.КлючПараметров.Использование = Истина;
		Набор.Прочитать();
		Если Набор.Количество() = 1 Тогда 
			Если ЕстьОшибка = "" Тогда
				Набор[0].РезультатОтправки = Истина;
			КонецЕсли;
			Набор[0].ОшибкаОтправки = ЕстьОшибка;
			Набор[0].ДатаОтправки = ТекущаяДата(); 
			Набор[0].КоличествоПопыток = Набор[0].КоличествоПопыток + 1; 
		КонецЕсли;
		Набор.Записать();
	КонецЦикла;
КонецПроцедуры 

Функция СтрокаJSONВСтруктуруПараметров(СтрокаJSON)    
	Если СтрокаJSON = "" Тогда
		Возврат Новый Структура;
	КонецЕсли;
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	Структура = ПрочитатьJSON(ЧтениеJSON, Ложь);
	СтруктураПараметров = Новый Структура;
	Для каждого эл из Структура Цикл  
		Если Не ТипЗнч(эл.Значение) = Тип("Массив") Тогда 
			СтруктураПараметров.Вставить(эл.Ключ,эл.Значение);
			Продолжить;
		КонецЕсли;
		Если эл.Значение[0] = "Дата" Тогда
			Значение = ПрочитатьДатуJSON(Формат(эл.Значение[1], "ЧГ="), ФорматДатыJSON.ISO);
			СтруктураПараметров.Вставить(эл.Ключ, Значение);
			Продолжить;
		КонецЕсли;
		// <-- Пантелеев Д.И. 17.04.2023, Ссылка на задачу в Redmine (Jira): SD-22910 
		Если эл.Значение[0] = "ТаблицаЗначений" Тогда  
			ТЗ = Новый ТаблицаЗначений;
			к = 1;
			Пока к < эл.Значение.Количество() Цикл 
				Если к = 1 Тогда
					ТЗ = СтруктураВТЗ(СтрокаJSONВСтруктуруПараметров(эл.Значение[к]));
				Иначе
					врТЗ = СтруктураВТЗ(СтрокаJSONВСтруктуруПараметров(эл.Значение[к]));
					новСтр = ТЗ.Добавить();
					ЗаполнитьЗначенияСвойств(новСтр, врТЗ[0]);
				КонецЕсли; 
				к = к + 1;
			КонецЦикла;
			СтруктураПараметров.Вставить(эл.Ключ, ТЗ);
			Продолжить;
		КонецЕсли; 
		// --> Пантелеев Д.И. 17.04.2023
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(эл.Значение[0]);
		Если СтрНайти(эл.Значение[0], "Перечисление") Тогда  
			Значение = Менеджер.Получить(эл.Значение[1]);
		Иначе
			Значение = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(эл.Значение[1]));
		КонецЕсли;
		СтруктураПараметров.Вставить(эл.Ключ, Значение);
	КонецЦикла;
	ЧтениеJSON.Закрыть(); 
	Возврат СтруктураПараметров; 
КонецФункции

Функция СтруктураВТЗ(Структра) 
	
	ТЗ = Новый ТаблицаЗначений;
	НовСтр=ТЗ.Добавить();

	Для Каждого ТекЭлем из Структра Цикл
		
		ТЗ.Колонки.Добавить(ТекЭлем.Ключ);
			
		НовСтр[ТекЭлем.Ключ] = ТекЭлем.Значение;                          
		
	КонецЦикла;
 	
	Возврат ТЗ;
	
КонецФункции

Процедура ДобавитьЗаписьВРегистрВыполнениеЗаданий(Задание, СтруктураПараметров = Неопределено, КлючПараметр = "") Экспорт 
	Если Не ТипЗнч(КлючПараметр) = Тип("Строка") Тогда
		КлючПараметр = Строка(КлючПараметр);
	КонецЕсли;
	Запись = РегистрыСведений.SQLВыполнениеЗаданий.СоздатьМенеджерЗаписи();
	Запись.Задание = Задание;
	Запись.ДатаЗаписи = ТекущаяДата();
	Если ЗначениеЗаполнено(КлючПараметр) Тогда
		Запись.КлючПараметров = КлючПараметр;
		Если ЗначениеЗаполнено(СтруктураПараметров) Тогда
			Запись.СтрокаJson = СтруктураПараметровВСтрокуJSON(СтруктураПараметров);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(СтруктураПараметров) Тогда
		Запись.КлючПараметров = "Истина";
		Запись.СтрокаJson = СтруктураПараметровВСтрокуJSON(СтруктураПараметров);
	КонецЕсли;
	Запись.Записать(Истина);
КонецПроцедуры 

Функция СтруктураПараметровВСтрокуJSON(СтруктураПараметров)   
	//ЗаписьJSON = Новый ЗаписьJSON;
	//ЗаписьJSON.ПроверятьСтруктуру = Ложь;
	//ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON;
	//ЗаписьJSON.ОткрытьФайл("ИмяФайла",,,ПараметрыЗаписиJSON);
	//ЗаписатьJSON(ЗаписьJSON, СтруктураПараметров, Новый НастройкиСериализацииJSON);  
	Структура = Новый Структура;
	Для каждого эл из СтруктураПараметров Цикл
		Если ТипЗнч(Эл.Значение) = Тип("Строка")
			или ТипЗнч(Эл.Значение) = Тип("Число")
			или ТипЗнч(Эл.Значение) = Тип("Булево") 
			или Эл.Значение = Неопределено 
			Тогда
			Структура.Вставить(эл.Ключ, эл.Значение);
			Продолжить;
		КонецЕсли;
		Если ТипЗнч(Эл.Значение) = Тип("Дата") Тогда
			Массив = Новый Массив; 
			Массив.Добавить("Дата");
			Массив.Добавить(эл.Значение);
			Структура.Вставить(эл.Ключ, Массив);
			Продолжить;
		КонецЕсли; 
		// <-- Пантелеев Д.И. 17.04.2023, Ссылка на задачу в Redmine (Jira): SD-22910 
		Если ТипЗнч(Эл.Значение) = Тип("ТаблицаЗначений") Тогда   
			Массив = Новый Массив; 
			Массив.Добавить("ТаблицаЗначений"); 
			МассивСтруктур = ТЗВСтруктуру(эл.Значение);
			Для каждого элМС из МассивСтруктур Цикл
				Массив.Добавить(СтруктураПараметровВСтрокуJSON(элМС));
			КонецЦикла;
			Структура.Вставить(эл.Ключ, Массив);
			Продолжить;
		КонецЕсли;	
		// --> Пантелеев Д.И. 17.04.2023
		Массив = Новый Массив; 
		Тип = Метаданные.НайтиПоТипу(ТипЗнч(эл.Значение)).ПолноеИмя();
		Массив.Добавить(Тип); 
		Если СтрНайти(Тип, "Перечисление") Тогда
			Массив.Добавить(Перечисления[эл.Значение.Метаданные().Имя].Индекс(эл.Значение)); 
		Иначе 
			Массив.Добавить(Строка(эл.Значение.УникальныйИдентификатор())); 
		КонецЕсли;
		Структура.Вставить(эл.Ключ, Массив);
	КонецЦикла;
	ЗначенияJSON = Новый ЗаписьJSON;
	ЗначенияJSON.ПроверятьСтруктуру = Ложь;
	ЗначенияJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗначенияJSON, Структура,);
	Возврат ЗначенияJSON.Закрыть();
	//СтрокаJSON = ЗначенияJSON.Закрыть(); 
	//Возврат СтрЗаменить(СтрЗаменить(СтрокаJSON, "\r\n", Символы.ПС), "\", ""); 
КонецФункции 

Функция ТЗВСтруктуру(ТабЗначений)

	Результат = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТабЗначений);
	КоллекцияКолонок = ТабЗначений.Колонки;	
	
	Для каждого ТекЭлемента из Результат Цикл		
		Для каждого ТекКолонки из КоллекцияКолонок Цикл
			мЗначение	=	ТекЭлемента[ТекКолонки.имя];
			ТекЭлемента[ТекКолонки.имя]	= мЗначение;			
		КонецЦикла;	
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции


Процедура ВыполнитьЗадание(Задание, СтруктураПараметров = Неопределено, ЕстьОшибка = "") 
	Если Задание.Отключено Тогда
		ЕстьОшибка = "Задание отключено";
		Возврат;
	КонецЕсли; 
	
	Для Каждого Шаг Из Задание.Сценарий Цикл
		ОтказОтПродолжения = Ложь;
		ВыполнитьШагЗадания(Шаг.КомандаСценария, СтруктураПараметров, ОтказОтПродолжения, ЕстьОшибка);
		Если ОтказОтПродолжения Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	//ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();
	//Если ЭлектроннаяРассылка.СпособФормированияПисьма = 0 Тогда
	//	Если ЭлектроннаяРассылка.ЕстьАлгоритмПроверкиДоПисьма Тогда
	//		ОтказОтПисьма = Ложь;
	//		Попытка
	//			Выполнить(ЭлектроннаяРассылка.АлгоритмПроверокДоФормированияПисьма);
	//		Исключение
	//			Если ОписаниеОшибки() = "" Тогда
	//				ЕстьОшибка = "Неизвестная ошибка!";	
	//			Иначе					
	//				ЕстьОшибка = ОписаниеОшибки();
	//			КонецЕсли;
	//			ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при выполнение рассылки: %1.",ЭлектроннаяРассылка.Наименование),УровеньЖурналаРегистрации.Ошибка,ЭлектроннаяРассылка.Метаданные(),ЭлектроннаяРассылка,ОписаниеОшибки());
	//			ОтказОтПисьма = Истина;
	//		КонецПопытки;
	//		Если ОтказОтПисьма = Истина Тогда
	//			Возврат;
	//		КонецЕсли;
	//	КонецЕсли;
	//	Если ЭлектроннаяРассылка.СоздаватьЭлектронноеПисьмо Тогда
	//		СформироватьПисьмо(ЭлектроннаяРассылка, СтруктураПараметров, ЕстьОшибка);   
	//	Иначе 
	//		ОтправитьБезФормированияЭлектронногоПисьмаПисьма(ЭлектроннаяРассылка, СтруктураПараметров, ЕстьОшибка);	
	//	КонецЕсли; 
	//ИначеЕсли ЭлектроннаяРассылка.СпособФормированияПисьма = 1 Тогда 
	//	Попытка
	//		Выполнить(ЭлектроннаяРассылка.АлгоритмЗаполненияПисьмаОбщий);
	//	Исключение
	//		Если ОписаниеОшибки() = "" Тогда
	//			ЕстьОшибка = "Неизвестная ошибка!";	
	//		Иначе					
	//			ЕстьОшибка = ОписаниеОшибки();
	//		КонецЕсли;
	//		ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при выполнение рассылки: %1.",ЭлектроннаяРассылка.Наименование),УровеньЖурналаРегистрации.Ошибка,ЭлектроннаяРассылка.Метаданные(),ЭлектроннаяРассылка,ОписаниеОшибки());
	//	КонецПопытки;
	//КонецЕсли;
	//Если ЕстьОшибка = "" Тогда
	//	ОценкаПроизводительности.ЗакончитьЗамерВремени(СтрШаблон("Электронная рассылка: %1", ЭлектроннаяРассылка.Наименование),ВремяНачала);
	//КонецЕсли;
КонецПроцедуры

//Процедура ВыполнитьШагЗадания(ТекстКоманды, СтруктураПараметров = Неопределено, ОтказОтПродолжения, ЕстьОшибка = "")
//	Если ЗначениеЗаполнено(ТекстКоманды) Тогда
//		//ТекстПисьма = "";  
//		Попытка
//			Выполнить(ТекстКоманды);
//		Исключение   
//			Если ОписаниеОшибки() = "" Тогда
//				ЕстьОшибка = "Неизвестная ошибка!";	
//			Иначе					
//				ЕстьОшибка = ОписаниеОшибки();
//			КонецЕсли;
//			//ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при выполнение шага: %1.",ЭлектроннаяРассылка.Наименование),УровеньЖурналаРегистрации.Ошибка,ЭлектроннаяРассылка.Метаданные(),ЭлектроннаяРассылка,ОписаниеОшибки());
//			ОтказОтПродолжения = Истина;
//		КонецПопытки;
//		//Возврат ТекстПисьма;
//	КонецЕсли;
//КонецПроцедуры  
Процедура ВыполнитьШагЗадания(ТекстКоманды, СтруктураПараметров = Неопределено, ОтказОтПродолжения, ЕстьОшибка = "")
	Если ЗначениеЗаполнено(ТекстКоманды) Тогда
		Выполнить(ТекстКоманды);
			//ЗаписьЖурналаРегистрации(СтрШаблон("Ошибка при выполнение шага: %1.",ЭлектроннаяРассылка.Наименование),УровеньЖурналаРегистрации.Ошибка,ЭлектроннаяРассылка.Метаданные(),ЭлектроннаяРассылка,ОписаниеОшибки());
	КонецЕсли;
	Если ЕстьОшибка <> "" Тогда
		 ОтказОтПродолжения = Истина;
	КонецЕсли;
КонецПроцедуры
